app/Http/Controllers/Api/UserController.php

select count(*) as aggregate from `users`
---
    public function index(Request $request)
    {
        if (intval($request->page) === 0) {
            return User::all();
        }
        return User::paginate(15);