app/Http/Controllers/Api/User/AbilityController.php

select `nom_role` from `roles` inner join `user_roles` on `roles`.`id` = `user_roles`.`role_id` where `user_roles`.`user_id` = 8
---
    public function index()
    {
        $permissions = auth()->user()->roles()->pluck('nom_role');