app/Http/Controllers/Api/User/FonctionController.php

select count(*) as aggregate from `fonctions`
---
    public function index()
    {
        return Fonction::paginate();