app/Http/Controllers/Api/Role/RoleController.php

select * from `roles`
---
    public function index()
    {
        return Role::all();